src/cf/Catalogs/КлассификаторКонстант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КлассификаторКонстант</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеКонстанты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КлассификаторКонстант/Ext/ManagerModule.bsl
Процедура УстановитьЗначение(Идентификатор, Значение, СоздаватьПриОтсутствии=Истина) Экспорт
	РезультатПоиска=Справочники.КлассификаторКонстант.НайтиПоКоду(Идентификатор);
	Если НЕ РезультатПоиска.Пустая() Тогда
		Объект=РезультатПоиска.ПолучитьОбъект();
	ИначеЕсли СоздаватьПриОтсутствии Тогда
		Объект=Справочники.КлассификаторКонстант.СоздатьЭлемент();
		Объект.Код=Идентификатор;
		Объект.Наименование=Идентификатор;
		Объект.Родитель=Справочники.КлассификаторКонстант.Пользовательские;
	КонецЕсли;

	Если Не Объект=Неопределено Тогда		
		Объект.ЗначениеКонстанты=Значение;
		Объект.Записать();
	Иначе
		Сообщить("Не найдена пользовательская константа <"+Идентификатор+">");
	КонецЕсли; 
КонецПроцедуры

Функция Значение(Идентификатор, ЗначениеПоУмолчанию=Неопределено, СообщатьПриОтсутствии=Ложь) Экспорт
	РезультатПоиска=Справочники.КлассификаторКонстант.НайтиПоКоду(Идентификатор);
	Если РезультатПоиска.Пустая() Тогда
		Если СообщатьПриОтсутствии Тогда
			Сообщить("Не найдена пользовательская константа <"+Идентификатор+">");
		КонецЕсли;
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат РезультатПоиска.ЗначениеКонстанты;
КонецФункции
